<template>
    <div class="wrapper-startPage">
        <div class="container">
            <h1 class="title">Жду</h1>
            <div class="container-buttons">
                <button type="button" class="button-login btn btn-lg btn-outline-dark button-pass"
                        @click="$router.push({name: 'login page'})">
                    войти
                </button>
                <button type="button" class="button-register btn btn-lg btn-outline-dark button-pass"
                        @click="$router.push({name: 'register page'})">
                    зарегистрироваться
                </button>
            </div>
        </div>
        <blockquote class="text-quotes">
            {{ arrQuotes[Math.floor(Math.random() * arrQuotes.length)] }}
        </blockquote>
        <img class="background-image" src="../assets/img/backgroundMap.png" alt="background Russia map">
    </div>
</template>

<script>
export default {
    name: 'Start Menu',
    data() {
        return {
            arrQuotes: [
                'Пусть парни знают и враг знает, что за каждым нашим бойцом стоит сильная и любящая российская женщина, а значит, вся страна',
                'Когда офицеры подписывают военный контракт, их жены негласно подписывают свой личный контракт о дальнейшей жизни.',
                'Сделаем все, что от нас зависит, для того, чтобы  чувствовали плечо рядом с собой',
                'Офицерские жены, Вы погон не носили. Ваша жизнь- гарнизоны На просторах России…',
                'Разлука часто в наш приходит дом… Хранит мои молитвы тишина. Но не привыкла думать о плохом. Я просто… офицерская жена',
                'Хочу, чтобы вы знали: мы эту боль с вами разделяем и, конечно, будем делать всё, для того чтобы вы не чувствовали себя забытыми, сделаем всё, что от нас зависит, для того чтобы чувствовали плечо рядом с собой.',
                'Мама, я иду воевать за Россию, я иду воевать за русский мир, я иду воевать за русское слово, за русскую память',
                'Они друг за друга горой, они друг другу помогают, поддерживают и физически, и морально, никогда не бросят бойцов – ни раненых, ни убитых. Даже приходится сбрасывать с себя обмундирование, те же пояса тактические, бронежилеты, только для того, чтобы облегчить себя и могли бы вынести товарищей',
                'То, что сегодня они выполняют свой долг перед Родиной, перед Отечеством, – это, конечно, с одной стороны вроде как в традиции, а с другой стороны, подчёркивает, что ничего никуда не исчезает.'
            ]
        }
    }
}
</script>

<style>
@import "@/assets/style/views/StartPage_view.scss";
</style>